---
title: FamilyLoadedIntoDocumentEventArgs
classe: Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FamilyLoadedIntoDocumentEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String FamilyName { get; }` | `familyLoadedIntoDocumentEventArgs.FamilyName` | String |
| `String FamilyPath { get; }` | `familyLoadedIntoDocumentEventArgs.FamilyPath` | String |
| `ElementId NewFamilyId { get; }` | `familyLoadedIntoDocumentEventArgs.NewFamilyId` | ElementId |
| `ElementId OriginalFamilyId { get; }` | `familyLoadedIntoDocumentEventArgs.OriginalFamilyId` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```